[
    {
        "name": "S. B. No. 16",
        "content": "\n\nAs Introduced\n133rd General Assembly\nRegular SessionS. B. No. 16\n2019-2020\nSenator Williams\nCosponsors: Senators Thomas, Fedor, Antonio\nA   B I L L\nTo amend sections 3301.0721, 3314.03, 3326.11, and \n3328.24 and to enact sections 109.749, \n3313.6024, and 4508.022 of the Revised Code \nregarding instruction for peace officers, \nstudents, and new or student drivers on proper \ninteractions with peace officers.\nBE IT ENACTED BY THE GENERAL ASSEMBLY OF THE STATE OF OHIO:\nSection 1. That sections 3301.0721, 3314.03, 3326.11, and \n3328.24 be amended and sections 109.749, 3313.6024, and 4508.022 \nof the Revised Code be enacted to read as follows:\nSec. 109.749.              (A) In accordance with Chapter 119. of the                                            \nRevised Code or pursuant to section 109.74 of the Revised Code, \nthe attorney general shall adopt rules governing the training of \npeace officers on proper interactions with civilians during \ntraffic stops and other in-person encounters. The rules shall \ninclude all of the following:\n(1) A specified amount of training that is necessary for \nsatisfactory completion of basic training programs at approved \npeace officer training schools;\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n\nS. B. No. 16Page 2\nAs Introduced\n(2) The time period within which an active duty peace \nofficer, who has been appointed prior to the effective date of \nthis section, is required to receive the training. The rules \nshall require such an officer to complete the training not later \nthan two years after that effective date.\n(3) A requirement that the training include all of the \nfollowing topics:\n(a) A person's rights during an interaction with a peace \nofficer, including all of the following:\n(i) When a peace officer may require a person to exit a \nvehicle;\n(ii) Constitutional protections from illegal search and \nseizure;\n(iii) The rights of a passenger in a vehicle who has been \npulled over for a traffic stop;\n(iv) The right for a citizen to record an encounter with a \npeace officer.\n(b) Proper actions for interacting with a civilian and \nmethods for diffusing a stressful encounter with a civilian;\n(c) Laws regarding questioning and detention by peace \nofficers, including any law requiring a person to present proof \nof identity to a peace officer, and the consequences for a \nperson's or officer's failure to comply with those laws.\n(4) Any other requirements and procedures necessary for \nthe proper implementation of this section.\n(B) Any peace officer who fails to complete the training \nrequired by this section within the time period established \n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n\nS. B. No. 16Page 3\nAs Introduced\nunder division (A)(2) of this section shall cease carrying a \nfirearm and shall cease performing the functions of a peace \nofficer until the peace officer provides evidence of completion \nof the training to the executive director of the peace officer \ntraining commission.\nSec. 3301.0721. (A) The superintendent of public \ninstruction shall develop a model curriculum for instruction in \ncollege and career readiness and financial literacy. The \ncurriculum shall focus on grades seven through twelve, but the \nsuperintendent may include other grade levels. When the model \ncurriculum has been developed, the department of education shall \nnotify all school districts, community schools established under \nChapter 3314. of the Revised Code, and STEM schools established \nunder Chapter 3326. of the Revised Code of the content of the \ncurriculum. Any district or school may utilize the model \ncurriculum. \n(B) The state board of education, in collaboration with \nthe director of public safety, shall develop a model curriculum \nfor instruction in grades nine through twelve on proper \ninteractions with peace officers during traffic stops and other \nin-person encounters with peace officers. In developing the \ncurriculum under division (B) of this section, the state board \nand the director may consult with any interested party, \nincluding a volunteer work group convened for the purpose of \nmaking recommendations regarding the instruction. Before \nfinalizing any curriculum under division (B) of this section, \nthe state board and the director shall provide a reasonable \nperiod for public comment. The curriculum shall include both of \nthe following:\n(1) Information                 regarding all of the following:                               \n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\n61\n62\n63\n64\n65\n66\n67\n68\n69\n70\n71\n72\n73\n74\n75\n\nS. B. No. 16Page 4\nAs Introduced\n(a)    A person's rights during an interaction with a peace                                                      \nofficer, including all of the following:\n(i)    When a peace officer may require a person to exit a                                                     \nvehicle;\n(ii)     Constitutional protections from illegal search and                                                    \nseizure;\n(iii)      The rights of a passenger in a vehicle who has been                                                     \npulled over for a traffic stop;\n(iv)     The right to record an encounter with a peace                                               \nofficer.\n(b)    Proper actions for interacting with a peace officer                                                     \nand methods for diffusing a stressful encounter with a peace \nofficer;\n(c)    Which individuals are considered peace officers, and                                                      \ntheir duties and responsibilities;\n(d)    Laws regarding questioning and detention by peace                                                   \nofficers, including any law requiring a person to present proof \nof identity to a peace officer, and the consequences for a \nperson's or officer's failure to comply with those laws;\n(e)    Procedures for filing a complaint against or a                                                \ncompliment on behalf of a peace officer.\n(2) Demonstrations and role-play activities in a classroom \nsetting, including an after-the-fact debriefing of students, \nthat allow students to better understand how interactions \nbetween civilians and peace officers can and should unfold.\nAs used in this section, \"peace officer\" has the same \nmeaning as in section 109.71 of the Revised Code.\n76\n77\n78\n79\n80\n81\n82\n83\n84\n85\n86\n87\n88\n89\n90\n91\n92\n93\n94\n95\n96\n97\n98\n99\n100\n101\n102\n\nS. B. No. 16Page 5\nAs Introduced\nSec. 3313.6024.                The board of education of each city,                                      \nlocal, exempted village, and joint vocational school district \nshall provide instruction on proper interactions with peace \nofficers during traffic stops and other in-person encounters \nusing the model curriculum developed under division (B) of \nsection 3301.0721 of the Revised Code. Each district shall \ninclude this instruction in one or more courses offered under \ndivision (C) of section 3313.603 of the Revised Code for \nstudents in grades nine through twelve. Each district may modify \nthe instruction in the model curriculum as appropriate for the \ndistrict's community. In modifying the instruction, the district \nshall solicit input from local law enforcement agencies, driver \ntraining schools, as that term is defined in section 4508.01 of \nthe Revised Code, and the community.\nSec. 3314.03. A copy of every contract entered into under \nthis section shall be filed with the superintendent of public \ninstruction. The department of education shall make available on \nits web site a copy of every approved, executed contract filed \nwith the superintendent under this section. \n(A) Each contract entered into between a sponsor and the \ngoverning authority of a community school shall specify the \nfollowing: \n(1) That the school shall be established as either of the \nfollowing: \n(a) A nonprofit corporation established under Chapter \n1702. of the Revised Code, if established prior to April 8, \n2003; \n(b) A public benefit corporation established under Chapter \n1702. of the Revised Code, if established after April 8, 2003. \n103\n104\n105\n106\n107\n108\n109\n110\n111\n112\n113\n114\n115\n116\n117\n118\n119\n120\n121\n122\n123\n124\n125\n126\n127\n128\n129\n130\n131\n\nS. B. No. 16Page 6\nAs Introduced\n(2) The education program of the school, including the \nschool's mission, the characteristics of the students the school \nis expected to attract, the ages and grades of students, and the \nfocus of the curriculum; \n(3) The academic goals to be achieved and the method of \nmeasurement that will be used to determine progress toward those \ngoals, which shall include the statewide achievement \nassessments; \n(4) Performance standards, including but not limited to \nall applicable report card measures set forth in section 3302.03 \nor 3314.017 of the Revised Code, by which the success of the \nschool will be evaluated by the sponsor; \n(5) The admission standards of section 3314.06 of the \nRevised Code and, if applicable, section 3314.061 of the Revised \nCode; \n(6)(a) Dismissal procedures; \n(b) A requirement that the governing authority adopt an \nattendance policy that includes a procedure for automatically \nwithdrawing a student from the school if the student without a \nlegitimate excuse fails to participate in seventy-two \nconsecutive hours of the learning opportunities offered to the \nstudent. \n(7) The ways by which the school will achieve racial and \nethnic balance reflective of the community it serves; \n(8) Requirements for financial audits by the auditor of \nstate. The contract shall require financial records of the \nschool to be maintained in the same manner as are financial \nrecords of school districts, pursuant to rules of the auditor of \nstate. Audits shall be conducted in accordance with section \n132\n133\n134\n135\n136\n137\n138\n139\n140\n141\n142\n143\n144\n145\n146\n147\n148\n149\n150\n151\n152\n153\n154\n155\n156\n157\n158\n159\n160\n\nS. B. No. 16Page 7\nAs Introduced\n117.10 of the Revised Code. \n(9) An addendum to the contract outlining the facilities \nto be used that contains at least the following information: \n(a) A detailed description of each facility used for \ninstructional purposes; \n(b) The annual costs associated with leasing each facility \nthat are paid by or on behalf of the school; \n(c) The annual mortgage principal and interest payments \nthat are paid by the school; \n(d) The name of the lender or landlord, identified as \nsuch, and the lender's or landlord's relationship to the \noperator, if any. \n(10) Qualifications of teachers, including a requirement \nthat the school's classroom teachers be licensed in accordance \nwith sections 3319.22 to 3319.31 of the Revised Code, except \nthat a community school may engage noncertificated persons to \nteach up to twelve hours per week pursuant to section 3319.301 \nof the Revised Code. \n(11) That the school will comply with the following \nrequirements: \n(a) The school will provide learning opportunities to a \nminimum of twenty-five students for a minimum of nine hundred \ntwenty hours per school year. \n(b) The governing authority will purchase liability \ninsurance, or otherwise provide for the potential liability of \nthe school. \n(c) The school will be nonsectarian in its programs, \n161\n162\n163\n164\n165\n166\n167\n168\n169\n170\n171\n172\n173\n174\n175\n176\n177\n178\n179\n180\n181\n182\n183\n184\n185\n186\n187\n\nS. B. No. 16Page 8\nAs Introduced\nadmission policies, employment practices, and all other \noperations, and will not be operated by a sectarian school or \nreligious institution. \n(d) The school will comply with sections 9.90, 9.91, \n109.65, 121.22, 149.43, 2151.357, 2151.421, 2313.19, 3301.0710, \n3301.0711, 3301.0712, 3301.0715, 3301.0729, 3301.948, 3313.472, \n3313.50, 3313.536, 3313.539, 3313.5310, 3313.608, 3313.609, \n3313.6012, 3313.6013, 3313.6014, 3313.6015, 3313.6020, \n3313.6024, 3313.643, 3313.648, 3313.6411, 3313.66, 3313.661, \n3313.662, 3313.666, 3313.667, 3313.668, 3313.67, 3313.671, \n3313.672, 3313.673, 3313.69, 3313.71, 3313.716, 3313.718, \n3313.719, 3313.7112, 3313.721, 3313.80, 3313.814, 3313.816, \n3313.817, 3313.86, 3313.89, 3313.96, 3319.073, 3319.074, \n3319.321, 3319.39, 3319.391, 3319.41, 3319.46, 3321.01, \n3321.041, 3321.13, 3321.14, 3321.141, 3321.17, 3321.18, 3321.19, \n3321.191, 3327.10, 4111.17, 4113.52, and 5705.391 and Chapters \n117., 1347., 2744., 3365., 3742., 4112., 4123., 4141., and 4167. \nof the Revised Code as if it were a school district and will \ncomply with section 3301.0714 of the Revised Code in the manner \nspecified in section 3314.17 of the Revised Code. \n(e) The school shall comply with Chapter 102. and section \n2921.42 of the Revised Code. \n(f) The school will comply with sections 3313.61, \n3313.611, and 3313.614 of the Revised Code, except that for \nstudents who enter ninth grade for the first time before July 1, \n2010, the requirement in sections 3313.61 and 3313.611 of the \nRevised Code that a person must successfully complete the \ncurriculum in any high school prior to receiving a high school \ndiploma may be met by completing the curriculum adopted by the \ngoverning authority of the community school rather than the \n188\n189\n190\n191\n192\n193\n194\n195\n196\n197\n198\n199\n200\n201\n202\n203\n204\n205\n206\n207\n208\n209\n210\n211\n212\n213\n214\n215\n216\n217\n\nS. B. No. 16Page 9\nAs Introduced\ncurriculum specified in Title XXXIII of the Revised Code or any \nrules of the state board of education. Beginning with students \nwho enter ninth grade for the first time on or after July 1, \n2010, the requirement in sections 3313.61 and 3313.611 of the \nRevised Code that a person must successfully complete the \ncurriculum of a high school prior to receiving a high school \ndiploma shall be met by completing the requirements prescribed \nin division (C) of section 3313.603 of the Revised Code, unless \nthe person qualifies under division (D) or (F) of that section. \nEach school shall comply with the plan for awarding high school \ncredit based on demonstration of subject area competency, and \nbeginning with the 2017-2018 school year, with the updated plan \nthat permits students enrolled in seventh and eighth grade to \nmeet curriculum requirements based on subject area competency \nadopted by the state board of education under divisions (J)(1) \nand (2) of section 3313.603 of the Revised Code. Beginning with \nthe 2018-2019 school year, the school shall comply with the \nframework for granting units of high school credit to students \nwho demonstrate subject area competency through work-based \nlearning experiences, internships, or cooperative education \ndeveloped by the department under division (J)(3) of section \n3313.603 of the Revised Code. \n(g) The school governing authority will submit within four \nmonths after the end of each school year a report of its \nactivities and progress in meeting the goals and standards of \ndivisions (A)(3) and (4) of this section and its financial \nstatus to the sponsor and the parents of all students enrolled \nin the school. \n(h) The school, unless it is an internet- or computer-\nbased community school, will comply with section 3313.801 of the \nRevised Code as if it were a school district. \n218\n219\n220\n221\n222\n223\n224\n225\n226\n227\n228\n229\n230\n231\n232\n233\n234\n235\n236\n237\n238\n239\n240\n241\n242\n243\n244\n245\n246\n247\n248\n\nS. B. No. 16Page 10\nAs Introduced\n(i) If the school is the recipient of moneys from a grant \nawarded under the federal race to the top program, Division (A), \nTitle XIV, Sections 14005 and 14006 of the \"American Recovery \nand Reinvestment Act of 2009,\" Pub. L. No. 111-5, 123 Stat. 115, \nthe school will pay teachers based upon performance in \naccordance with section 3317.141 and will comply with section \n3319.111 of the Revised Code as if it were a school district. \n(j) If the school operates a preschool program that is \nlicensed by the department of education under sections 3301.52 \nto 3301.59 of the Revised Code, the school shall comply with \nsections 3301.50 to 3301.59 of the Revised Code and the minimum \nstandards for preschool programs prescribed in rules adopted by \nthe state board under section 3301.53 of the Revised Code. \n(k) The school will comply with sections 3313.6021 and \n3313.6023 of the Revised Code as if it were a school district \nunless it is either of the following: \n(i) An internet- or computer-based community school; \n(ii) A community school in which a majority of the \nenrolled students are children with disabilities as described in \ndivision (A)(4)(b) of section 3314.35 of the Revised Code. \n(12) Arrangements for providing health and other benefits \nto employees; \n(13) The length of the contract, which shall begin at the \nbeginning of an academic year. No contract shall exceed five \nyears unless such contract has been renewed pursuant to division \n(E) of this section. \n(14) The governing authority of the school, which shall be \nresponsible for carrying out the provisions of the contract; \n249\n250\n251\n252\n253\n254\n255\n256\n257\n258\n259\n260\n261\n262\n263\n264\n265\n266\n267\n268\n269\n270\n271\n272\n273\n274\n275\n276\n\nS. B. No. 16Page 11\nAs Introduced\n(15) A financial plan detailing an estimated school budget \nfor each year of the period of the contract and specifying the \ntotal estimated per pupil expenditure amount for each such year. \n(16) Requirements and procedures regarding the disposition \nof employees of the school in the event the contract is \nterminated or not renewed pursuant to section 3314.07 of the \nRevised Code; \n(17) Whether the school is to be created by converting all \nor part of an existing public school or educational service \ncenter building or is to be a new start-up school, and if it is \na converted public school or service center building, \nspecification of any duties or responsibilities of an employer \nthat the board of education or service center governing board \nthat operated the school or building before conversion is \ndelegating to the governing authority of the community school \nwith respect to all or any specified group of employees provided \nthe delegation is not prohibited by a collective bargaining \nagreement applicable to such employees; \n(18) Provisions establishing procedures for resolving \ndisputes or differences of opinion between the sponsor and the \ngoverning authority of the community school; \n(19) A provision requiring the governing authority to \nadopt a policy regarding the admission of students who reside \noutside the district in which the school is located. That policy \nshall comply with the admissions procedures specified in \nsections 3314.06 and 3314.061 of the Revised Code and, at the \nsole discretion of the authority, shall do one of the following: \n(a) Prohibit the enrollment of students who reside outside \nthe district in which the school is located; \n277\n278\n279\n280\n281\n282\n283\n284\n285\n286\n287\n288\n289\n290\n291\n292\n293\n294\n295\n296\n297\n298\n299\n300\n301\n302\n303\n304\n305\n\nS. B. No. 16Page 12\nAs Introduced\n(b) Permit the enrollment of students who reside in \ndistricts adjacent to the district in which the school is \nlocated; \n(c) Permit the enrollment of students who reside in any \nother district in the state. \n(20) A provision recognizing the authority of the \ndepartment of education to take over the sponsorship of the \nschool in accordance with the provisions of division (C) of \nsection 3314.015 of the Revised Code; \n(21) A provision recognizing the sponsor's authority to \nassume the operation of a school under the conditions specified \nin division (B) of section 3314.073 of the Revised Code; \n(22) A provision recognizing both of the following: \n(a) The authority of public health and safety officials to \ninspect the facilities of the school and to order the facilities \nclosed if those officials find that the facilities are not in \ncompliance with health and safety laws and regulations; \n(b) The authority of the department of education as the \ncommunity school oversight body to suspend the operation of the \nschool under section 3314.072 of the Revised Code if the \ndepartment has evidence of conditions or violations of law at \nthe school that pose an imminent danger to the health and safety \nof the school's students and employees and the sponsor refuses \nto take such action. \n(23) A description of the learning opportunities that will \nbe offered to students including both classroom-based and non-\nclassroom-based learning opportunities that is in compliance \nwith criteria for student participation established by the \ndepartment under division (H)(2) of section 3314.08 of the \n306\n307\n308\n309\n310\n311\n312\n313\n314\n315\n316\n317\n318\n319\n320\n321\n322\n323\n324\n325\n326\n327\n328\n329\n330\n331\n332\n333\n334\n\nS. B. No. 16Page 13\nAs Introduced\nRevised Code; \n(24) The school will comply with sections 3302.04 and \n3302.041 of the Revised Code, except that any action required to \nbe taken by a school district pursuant to those sections shall \nbe taken by the sponsor of the school. However, the sponsor \nshall not be required to take any action described in division \n(F) of section 3302.04 of the Revised Code. \n(25) Beginning in the 2006-2007 school year, the school \nwill open for operation not later than the thirtieth day of \nSeptember each school year, unless the mission of the school as \nspecified under division (A)(2) of this section is solely to \nserve dropouts. In its initial year of operation, if the school \nfails to open by the thirtieth day of September, or within one \nyear after the adoption of the contract pursuant to division (D) \nof section 3314.02 of the Revised Code if the mission of the \nschool is solely to serve dropouts, the contract shall be void. \n(26) Whether the school's governing authority is planning \nto seek designation for the school as a STEM school equivalent \nunder section 3326.032 of the Revised Code; \n(27) That the school's attendance and participation \npolicies will be available for public inspection; \n(28) That the school's attendance and participation \nrecords shall be made available to the department of education, \nauditor of state, and school's sponsor to the extent permitted \nunder and in accordance with the \"Family Educational Rights and \nPrivacy Act of 1974,\" 88 Stat. 571, 20 U.S.C. 1232g, as amended, \nand any regulations promulgated under that act, and section \n3319.321 of the Revised Code; \n(29) If a school operates using the blended learning \n335\n336\n337\n338\n339\n340\n341\n342\n343\n344\n345\n346\n347\n348\n349\n350\n351\n352\n353\n354\n355\n356\n357\n358\n359\n360\n361\n362\n363\n\nS. B. No. 16Page 14\nAs Introduced\nmodel, as defined in section 3301.079 of the Revised Code, all \nof the following information: \n(a) An indication of what blended learning model or models \nwill be used; \n(b) A description of how student instructional needs will \nbe determined and documented; \n(c) The method to be used for determining competency, \ngranting credit, and promoting students to a higher grade level; \n(d) The school's attendance requirements, including how \nthe school will document participation in learning \nopportunities; \n(e) A statement describing how student progress will be \nmonitored; \n(f) A statement describing how private student data will \nbe protected; \n(g) A description of the professional development \nactivities that will be offered to teachers. \n(30) A provision requiring that all moneys the school's \noperator loans to the school, including facilities loans or cash \nflow assistance, must be accounted for, documented, and bear \ninterest at a fair market rate; \n(31) A provision requiring that, if the governing \nauthority contracts with an attorney, accountant, or entity \nspecializing in audits, the attorney, accountant, or entity \nshall be independent from the operator with which the school has \ncontracted. \n(32) A provision requiring the governing authority to \n364\n365\n366\n367\n368\n369\n370\n371\n372\n373\n374\n375\n376\n377\n378\n379\n380\n381\n382\n383\n384\n385\n386\n387\n388\n389\n390\n\nS. B. No. 16Page 15\nAs Introduced\nadopt an enrollment and attendance policy that requires a \nstudent's parent to notify the community school in which the \nstudent is enrolled when there is a change in the location of \nthe parent's or student's primary residence. \n(33) A provision requiring the governing authority to \nadopt a student residence and address verification policy for \nstudents enrolling in or attending the school. \n(B) The community school shall also submit to the sponsor \na comprehensive plan for the school. The plan shall specify the \nfollowing: \n(1) The process by which the governing authority of the \nschool will be selected in the future; \n(2) The management and administration of the school; \n(3) If the community school is a currently existing public \nschool or educational service center building, alternative \narrangements for current public school students who choose not \nto attend the converted school and for teachers who choose not \nto teach in the school or building after conversion; \n(4) The instructional program and educational philosophy \nof the school; \n(5) Internal financial controls. \nWhen submitting the plan under this division, the school \nshall also submit copies of all policies and procedures \nregarding internal financial controls adopted by the governing \nauthority of the school. \n(C) A contract entered into under section 3314.02 of the \nRevised Code between a sponsor and the governing authority of a \ncommunity school may provide for the community school governing \n391\n392\n393\n394\n395\n396\n397\n398\n399\n400\n401\n402\n403\n404\n405\n406\n407\n408\n409\n410\n411\n412\n413\n414\n415\n416\n417\n418\n\nS. B. No. 16Page 16\nAs Introduced\nauthority to make payments to the sponsor, which is hereby \nauthorized to receive such payments as set forth in the contract \nbetween the governing authority and the sponsor. The total \namount of such payments for monitoring, oversight, and technical \nassistance of the school shall not exceed three per cent of the \ntotal amount of payments for operating expenses that the school \nreceives from the state. \n(D) The contract shall specify the duties of the sponsor \nwhich shall be in accordance with the written agreement entered \ninto with the department of education under division (B) of \nsection 3314.015 of the Revised Code and shall include the \nfollowing: \n(1) Monitor the community school's compliance with all \nlaws applicable to the school and with the terms of the \ncontract; \n(2) Monitor and evaluate the academic and fiscal \nperformance and the organization and operation of the community \nschool on at least an annual basis; \n(3) Report on an annual basis the results of the \nevaluation conducted under division (D)(2) of this section to \nthe department of education and to the parents of students \nenrolled in the community school; \n(4) Provide technical assistance to the community school \nin complying with laws applicable to the school and terms of the \ncontract; \n(5) Take steps to intervene in the school's operation to \ncorrect problems in the school's overall performance, declare \nthe school to be on probationary status pursuant to section \n3314.073 of the Revised Code, suspend the operation of the \n419\n420\n421\n422\n423\n424\n425\n426\n427\n428\n429\n430\n431\n432\n433\n434\n435\n436\n437\n438\n439\n440\n441\n442\n443\n444\n445\n446\n447\n\nS. B. No. 16Page 17\nAs Introduced\nschool pursuant to section 3314.072 of the Revised Code, or \nterminate the contract of the school pursuant to section 3314.07 \nof the Revised Code as determined necessary by the sponsor; \n(6) Have in place a plan of action to be undertaken in the \nevent the community school experiences financial difficulties or \ncloses prior to the end of a school year. \n(E) Upon the expiration of a contract entered into under \nthis section, the sponsor of a community school may, with the \napproval of the governing authority of the school, renew that \ncontract for a period of time determined by the sponsor, but not \nending earlier than the end of any school year, if the sponsor \nfinds that the school's compliance with applicable laws and \nterms of the contract and the school's progress in meeting the \nacademic goals prescribed in the contract have been \nsatisfactory. Any contract that is renewed under this division \nremains subject to the provisions of sections 3314.07, 3314.072, \nand 3314.073 of the Revised Code. \n(F) If a community school fails to open for operation \nwithin one year after the contract entered into under this \nsection is adopted pursuant to division (D) of section 3314.02 \nof the Revised Code or permanently closes prior to the \nexpiration of the contract, the contract shall be void and the \nschool shall not enter into a contract with any other sponsor. A \nschool shall not be considered permanently closed because the \noperations of the school have been suspended pursuant to section \n3314.072 of the Revised Code. \nSec. 3326.11. Each science, technology, engineering, and \nmathematics school established under this chapter and its \ngoverning body shall comply with sections 9.90, 9.91, 109.65, \n121.22, 149.43, 2151.357, 2151.421, 2313.19, 2921.42, 2921.43, \n448\n449\n450\n451\n452\n453\n454\n455\n456\n457\n458\n459\n460\n461\n462\n463\n464\n465\n466\n467\n468\n469\n470\n471\n472\n473\n474\n475\n476\n477\n\nS. B. No. 16Page 18\nAs Introduced\n3301.0714, 3301.0715, 3301.0729, 3301.948, 3313.14, 3313.15, \n3313.16, 3313.18, 3313.201, 3313.26, 3313.472, 3313.48, \n3313.481, 3313.482, 3313.50, 3313.536, 3313.539, 3313.5310, \n3313.608, 3313.6012, 3313.6013, 3313.6014, 3313.6015, 3313.6020, \n3313.6021, 3313.6024, 3313.61, 3313.611, 3313.614, 3313.615, \n3313.643, 3313.648, 3313.6411, 3313.66, 3313.661, 3313.662, \n3313.666, 3313.667, 3313.668, 3313.67, 3313.671, 3313.672, \n3313.673, 3313.69, 3313.71, 3313.716, 3313.718, 3313.719, \n3313.7112, 3313.721, 3313.80, 3313.801, 3313.814, 3313.816, \n3313.817, 3313.86, 3313.89, 3313.96, 3319.073, 3319.21, 3319.32, \n3319.321, 3319.35, 3319.39, 3319.391, 3319.41, 3319.45, 3319.46, \n3321.01, 3321.041, 3321.05, 3321.13, 3321.14, 3321.141, 3321.17, \n3321.18, 3321.19, 3321.191, 3327.10, 4111.17, 4113.52, and \n5705.391 and Chapters 102., 117., 1347., 2744., 3307., 3309., \n3365., 3742., 4112., 4123., 4141., and 4167. of the Revised Code \nas if it were a school district. \nSec. 3328.24. A college-preparatory boarding school \nestablished under this chapter and its board of trustees shall \ncomply with sections 102.02, 3301.0710, 3301.0711, 3301.0712, \n3301.0714, 3301.0729, 3301.948, 3313.536, 3313.6013, 3313.6021, \n3313.6024, 3313.6411, 3313.7112, 3313.721, 3313.89, 3319.39, \n3319.391, and 3319.46 and Chapter 3365. of the Revised Code as \nif the school were a school district and the school's board of \ntrustees were a district board of education.\nSec. 4508.022.               (A) The director of public safety shall                                         \nadapt the model curriculum on proper interactions with peace \nofficers developed under division (B) of section 3301.0721 of \nthe Revised Code                  so that it is              appropriate for the instructional                                   \nmethods of driver training schools.\n(B) The classroom instruction required by division (C) of \n478\n479\n480\n481\n482\n483\n484\n485\n486\n487\n488\n489\n490\n491\n492\n493\n494\n495\n496\n497\n498\n499\n500\n501\n502\n503\n504\n505\n506\n507\n\nS. B. No. 16Page 19\nAs Introduced\nsection 4508.02 of the Revised Code shall include the \ninstruction adapted under division (A) of this section.\n(C)     The director shall amend the digest of motor vehicle                                                     \nlaws, or any other reference document for the material covered \nin the written portions of the temporary instruction permit and \ndrivers' license examinations required under section 4507.11 of \nthe Revised Code, to include a separate section with instruction \non proper interactions when a driver is stopped by a peace \nofficer. The instruction shall be adapted from the model \ncurriculum described in division (A) of this section so that it \nis appropriate for new drivers.\n(D)     As used in this section, \"peace officer\" has the same                                                      \nmeaning as in section 109.71 of the Revised Code.\nSection 2. That existing sections 3301.0721, 3314.03, \n3326.11, and 3328.24 of the Revised Code are hereby repealed.\nSection 3. Section 3328.24 of the Revised Code is \npresented in this act as a composite of the section as amended \nby both Am. Sub. H.B. 410 and Sub. S.B. 3 of the 131st General \nAssembly. The General Assembly, applying the principle stated in \ndivision (B) of section 1.52 of the Revised Code that amendments \nare to be harmonized if reasonably capable of simultaneous \noperation, finds that the composite is the resulting version of \nthe section in effect prior to the effective date of the section \nas presented in this act. \n508\n509\n510\n511\n512\n513\n514\n515\n516\n517\n518\n519\n520\n521\n522\n523\n524\n525\n526\n527\n528\n529\n530\n531"
    }
]